{
  "documentId": "Report-on-ICCPR-2024.pdf",
  "chunks": [
    {
      "id": 0,
      "content": "1 \n \n \n \n \nIntroduction \n \n1. The National Commission for Human Rights (NCHR) is an ‘A’ status National Human Rights \nInstitution. Under the Principles related to the status of National Institutions (the Paris \nPrinciples) and Section 9 (f) of the National Commission for Human Rights Act, 2012, the \nNCHR has the power to make recommendations on the Government of Pakistan’s \ncompliance with international treaties, including the ICCPR. Further information on the \nNCHR can be found at: https://nchr.gov.pk/ \n2. The Commission thanks the United Nations Human Rights Committee (the Committee) for \nthe opportunity to provide a written contribution prior to its consideration of the \nGovernment of Pakistan’s Second report under the ICCPR. The Commission looks forward \nto further engaging with the Committee. \n3. This submission is based on work that has been undertaken by the Commission in \naccordance  with  its  mandate  and  functions,  or  otherwise  on  publicly available",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 4,
            "to": 22
          }
        }
      }
    },
    {
      "id": 1,
      "content": "3. This submission is based on work that has been undertaken by the Commission in \naccordance  with  its  mandate  and  functions,  or  otherwise  on  publicly available \ninformation. The Commission has brought the issues raised in this submission to the \nattention of the Government of Pakistan. \n4. This submission provides information concerning the civil and political rights of key \npopulation groups in Pakistan and other thematic issues engaging civil and political rights. \nIn relation to each section, the Commission has referred to the relevant articles of the \nICCPR engaged and (where appropriate) the relevant paragraph of the Committee’s list of \nissues prior to reporting dated 29 November 2023.  \n5. The Commission’s proposed recommendations are contained in the body of the text.  \n \nGeneral Information \nDomestic Enforceability of the ICCPR in Pakistan \n1. Pakistan  is  committed  to  upholding  its  international  obligations  under human  rights",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 21,
            "to": 34
          }
        }
      }
    },
    {
      "id": 2,
      "content": "General Information \nDomestic Enforceability of the ICCPR in Pakistan \n1. Pakistan  is  committed  to  upholding  its  international  obligations  under human  rights \ntreaties, including the International Covenant on Civil and Political Rights (ICCPR), which \nit ratified in 2010. The Constitution of Pakistan, 1973, enshrines fundamental rights that \nalign with many provisions of the ICCPR, such as the rights to life, liberty, dignity, fair trial, \nequality, and freedom of expression. These constitutional guarantees form the bedrock \nof  human  rights  protection  in  Pakistan  and  are  enforceable  through  the  country's  legal \nsystem. \n2. The superior judiciary, comprising the Supreme Court and High Courts, plays a critical role \nin   the   enforcement   of   fundamental   rights   under   Articles   184(3)   and   199   of   the \nConstitution. Citizens can invoke these provisions to challenge violations of their rights,",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 32,
            "to": 43
          }
        }
      }
    },
    {
      "id": 3,
      "content": "in   the   enforcement   of   fundamental   rights   under   Articles   184(3)   and   199   of   the \nConstitution. Citizens can invoke these provisions to challenge violations of their rights, \nensuring  that  domestic  courts protect  and  promote  the  rights  guaranteed  by  both  the",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 42,
            "to": 44
          }
        }
      }
    },
    {
      "id": 4,
      "content": "2 \n \n \n \n \nConstitution  and  international  obligations  like  the  ICCPR.  Additionally,  the  Supreme \nCourt's Human Rights Cell provides an accessible and expeditious mechanism to address \ngrievances  related  to  human  rights violations, reinforcing Pakistan’s commitment to \ninternational norms. \n3. The  judiciary  in  Pakistan  often  references  international  human  rights  instruments, \nincluding  the  ICCPR,  in  its  judgments.  In  some  cases,  even  non-ratified  conventions  are \ninvoked based on principles of customary international law.  \n4. The National Commission for Human Rights (NCHR), specialized commissions such as the, \nNational  Commission  on  the  Status  of  Women  (NCSW),  National  Commission  on  the \nRights  of  Child  (NCRC), and  the Federal  Ombudsman  Secretariat  for  Protection  Against \nHarassment  (FOSPAH)  and  the  Pakistan  Information  commission  also  contribute  to  the",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 46,
            "to": 61
          }
        }
      }
    },
    {
      "id": 5,
      "content": "Rights  of  Child  (NCRC), and  the Federal  Ombudsman  Secretariat  for  Protection  Against \nHarassment  (FOSPAH)  and  the  Pakistan  Information  commission  also  contribute  to  the \nimplementation    of    the    ICCPR    by    monitoring    violations,    reviewing    laws,    and \nrecommending  reforms.  These  institutions  provide  a  framework  for  ensuring  that  the \nstate's international obligations under the ICCPR are effectively translated into domestic \npolicy and action. \n5. Moreover, the Law and Justice Commission of Pakistan (LJCP) has been active in raising \nawareness  about  fundamental  rights  and  promoting  legal  empowerment  across  the \ncountry. Through its initiatives, such as the \"Qanoon Fehmi\" campaign, the LJCP seeks to \nenhance public knowledge of legal rights and improve access to justice, further facilitating \nthe enforcement of the ICCPR within Pakistan's legal and constitutional framework. \nSelected Issues",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 60,
            "to": 71
          }
        }
      }
    },
    {
      "id": 6,
      "content": "enhance public knowledge of legal rights and improve access to justice, further facilitating \nthe enforcement of the ICCPR within Pakistan's legal and constitutional framework. \nSelected Issues \nThe  Commission  considers  all  of  the  information  and  recommendations  provided  by  the \nHuman Rights Committee (HRC) under the 2017 Concluding Observations on Pakistan’s Initial \nReport to be of importance to the Government of Pakistan’s compliance with the ICCPR. \nHowever, the Commission wishes to draw the Committee’s attention to five priority areas: \nNational Human Rights Institutions (art 2)  \n1. The HRC under Concluding Observations issued on Pakistan’s Initial Report (“Concluding \nObservations”) recommended that the GoP “adopt all legislative, policy and institutional \nmeasures necessary to ensure that the National Commission for Human Rights is able to \ncarry  out  its  mandate  fully  and in  an  effective  and  independent  manner,  and  in  full",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 69,
            "to": 80
          }
        }
      }
    },
    {
      "id": 7,
      "content": "3 \n \n \n \n \nconformity  with  the  principles  relating  to  the  status  of  national  institutions  for  the \npromotion and protection of human rights (the Paris Principles)”\n1\n.  \n2. The National Commission for Human Rights (NCHR) of Pakistan has been recognized as an \nA-status   institution   by   the   Global   Alliance   for   National   Human   Rights   Institutions \n(GANHRI).\n2\n This  accreditation  indicates  that  NCHR  operates  in  full  compliance  with  the \nParis  Principles,  which  emphasize  a  broad-based mandate  rooted  in  universal  human \nrights  standards,  autonomy  from  the  government,  independence  guaranteed  by  law, \npluralism, adequate resources, and investigative powers.  \n3. The NCHR's governance structure also supports its adherence to the Paris Principles. With \na tenure of four years, the removal of any member before the completion of this term is",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 82,
            "to": 100
          }
        }
      }
    },
    {
      "id": 8,
      "content": "3. The NCHR's governance structure also supports its adherence to the Paris Principles. With \na tenure of four years, the removal of any member before the completion of this term is \nas  stringent  as  the  removal  of a  Supreme  Court  judge,  requiring  initiation under  Article \n209 of the Constitution and approval from the Supreme Judicial Council. The Commission, \ncomprising  50%  women,  ensures  diversity  in  its  operations,  including  gender,  ethnicity, \nand religion. \n4. The  NCHR  is  an  independent  and  impartial  body  which  shares  its  annual  financial  and \nperformance reports with the Parliament. The Commission's funding is directly allocated \nthrough a dedicated one-line budget from the Finance Division, bypassing the Ministry of \nHuman Rights (MoHR). The Chairperson of NCHR serves as the Principal Accounts Officer \n(PAO),   ensuring   direct   control   over   financial   matters.   The   Commission's   financial",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 99,
            "to": 109
          }
        }
      }
    },
    {
      "id": 9,
      "content": "Human Rights (MoHR). The Chairperson of NCHR serves as the Principal Accounts Officer \n(PAO),   ensuring   direct   control   over   financial   matters.   The   Commission's   financial \nindependence  is  further  solidified  by  the  approval  of  its  internally  drafted  rules  by  the \nState, reinforcing the legitimacy and operational autonomy of the NCHR. \n5. NCHR’s broad mandate, as outlined under Section 9(l) of the NCHR Act, empowers it to \ndetermine  its  own  actions  necessary  for  promoting  human  rights.  The  Commission  has \nstatutory powers to investigate human rights violations, equivalent to those of a civil court \nunder Section 13  of the NCHR Act, and can visit detention areas, take suo moto action, \nand become a party in court proceedings related to human rights violations. Additionally, \nSection  21  of  the  NCHR  Act  provides  for  the  establishment  of  Human  Rights  Courts  to \nexpedite the trial of offenses related to human rights violations.",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 108,
            "to": 118
          }
        }
      }
    },
    {
      "id": 10,
      "content": "Section  21  of  the  NCHR  Act  provides  for  the  establishment  of  Human  Rights  Courts  to \nexpedite the trial of offenses related to human rights violations. \n6. The  NCHR  has  handled  and  resolved  over  7,908  complaints  and  suo  moto  actions, \nconducted  173  visits  to  jails  and  detention  areas.\n3\n These  activities  underscore  the \nCommission's proactive role in monitoring and addressing human rights violations across \nthe country, in line with its mandate. Notable interventions include: \n \n                                                            \n \n \n1\n OHCHR. Principles relating to the status of National Human Rights Institutions (the Paris Principles). General Assembly \nResolution 48/13. 20 December 1993 \n2\n  NCHR given A-Status Accreditation by UN body. Express Tribune. May 19, 2024, Accessed here \n3\n  See: NCHR At a Glance, URL: https://nchr.gov.pk/judicial-investigative-monitoring/",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 117,
            "to": 135
          }
        }
      }
    },
    {
      "id": 11,
      "content": "4 \n \n \n \n \n Ban on Discriminatory Advertisements: NCHR’s investigation into the misuse of the \nquota system led to a nationwide ban on discriminatory job advertisements. \n Journalist Complaint Cell: A helpline was established for women journalists facing hate \nspeech and threats. \n Release of Foreign Fishermen Prisoners: NCHR successfully lobbied for the release of \n650 Indian fishermen prisoners. \n7. Under Section 9(d) of the NCHR Act, the Commission is empowered to recommend the \nadoption  of  new  legislation  or  amendments  to  existing  laws  to  better  protect  human \nrights. The NCHR has been instrumental in reviewing and advocating for several key pieces \nof legislation,    including    the    Prevention    of    Electronic    Crimes    Act,    2016,    the \ndecriminalization of suicide, Domestic Violence Bill and the Torture and Custodial Death \n(Prevention & Punishment) Bill, 2022.",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 137,
            "to": 153
          }
        }
      }
    },
    {
      "id": 12,
      "content": "decriminalization of suicide, Domestic Violence Bill and the Torture and Custodial Death \n(Prevention & Punishment) Bill, 2022.  \n8. While the National Commission for Human Rights (NCHR) has not directly investigated the \ninternal operations of Pakistan's intelligence agencies or armed forces, it has conducted \ninvestigations.  For  instance,  following  the  May  9th,  2023  protests  in  Lahore,  where  the \nresidence of a high-ranking army official was set on fire, NCHR investigated the treatment \nof  arrested  protesters  to  ensure  they  were  not  subjected  to  torture  or  inhuman \ntreatment.\n4\n The findings were compiled into a report and submitted to the Prime Minister \nfor   action.   The   NCHR   has   also   addressed   194   cases   of   enforced   disappearances, \nsuccessfully resolving or recovering 98 of them, highlighting its critical role in addressing \nserious human rights concerns in Pakistan.",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 152,
            "to": 164
          }
        }
      }
    },
    {
      "id": 13,
      "content": "successfully resolving or recovering 98 of them, highlighting its critical role in addressing \nserious human rights concerns in Pakistan. \n9. In  February  2024,  the  Finance  Division  imposed  a  ban  on  the  purchase  of  vehicles, \nmachinery, and equipment under the Public Sector Development Program (PSDP) for the \nfiscal  year  2023-24.  This  restriction  impacts  the  National  Commission  for  Human  Rights \n(NCHR), which relies on these resources to maintain complaint records, ensure efficient \noperations, and uphold transparency. Reliable transportation is essential for the NCHR to \naccess  all  regions  of  Pakistan  and  fulfill  its  nationwide  mandate.  Additionally,  the \nCommission's growing knowledge production wing requires advanced computer systems \nto manage research and increasing data volumes. Given the critical importance of these \nassets,  the  NCHR  respectfully  urges  the  government  to  reconsider  and  lift  the  ban  on",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 163,
            "to": 173
          }
        }
      }
    },
    {
      "id": 14,
      "content": "to manage research and increasing data volumes. Given the critical importance of these \nassets,  the  NCHR  respectfully  urges  the  government  to  reconsider  and  lift  the  ban  on \npurchasing physical assets for the Commission. \n                                                            \n \n \n4\n  See Press Release: NCHR Issues Detailed Report of Jail Visits Held to Investigate Allegations of Torture, Sexual Abuse, \nJune 23, 2023, URL: \nhttps://nchr.gov.pk/press_release/press-release-nchr-issues-detailed-report-of-jail-visits-held-to-investigate-allegations-of-\ntorture-sexual-abuse/",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 172,
            "to": 182
          }
        }
      }
    },
    {
      "id": 15,
      "content": "5 \n \n \n \n \n10. The social media platform \"X\" has been inaccessible in Pakistan since February 17, 2024, \nwithout  a  Virtual  Private  Network  (VPN).  This  restriction  impacts  NCHR's  ability to \ndisseminate   vital   information,   engage   with   local   and   international   human   rights \norganizations, and monitor the human rights situation within the country. \nRecommendations \nThe NCHR submits the following recommendations to the Government of Pakistan (GoP):  \n1. The  Commission  recognizes  that  the  government  has  not  interfered  with  its  work.  We \nurge the government to maintain this position and allow the commission to operate freely \nand  independently  in  accordance  with  its  mandate  under  the  NCHR  Act  and  the  Paris \nPrinciples.  \n2. Lift the ban imposed on the purchase of vehicles, machinery, and equipment under the \nPublic Sector Development Program (PSDP) to allow the NCHR to maintain its operational",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 185,
            "to": 201
          }
        }
      }
    },
    {
      "id": 16,
      "content": "Principles.  \n2. Lift the ban imposed on the purchase of vehicles, machinery, and equipment under the \nPublic Sector Development Program (PSDP) to allow the NCHR to maintain its operational \nefficiency and effectiveness in complaint resolution and human rights monitoring. \n3. Restore access to social media platforms, including \"X,\" to facilitate the NCHR's ability to \ndisseminate information, engage with stakeholders, and fulfill its mandate of monitoring \nhuman rights issues within the country. \nViolence against Women and Domestic Violence (art 6, art 9, General \nComment 35) \n1. In its 2017 Concluding Observations, the Human Rights Committee expressed its concern \nthat, “despite efforts made by the State party, violence against women is still prevalent”. \nIt  further  expressed its concerns by the “very low level of reporting of violence against \nwomen,  including  domestic  violence;  the  lack  of  prompt  and  effective  investigation  of",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 199,
            "to": 211
          }
        }
      }
    },
    {
      "id": 17,
      "content": "It  further  expressed its concerns by the “very low level of reporting of violence against \nwomen,  including  domestic  violence;  the  lack  of  prompt  and  effective  investigation  of \nsuch  cases;  the  low  level  of  prosecution  and  conviction  of  perpetrators;  and  the \ninsufficient level of assistance for victims”. \n2. The  prevalence  of  violence  against  women  remains  alarmingly  high.  According  to  the \nPakistan Demographic  and  Health  Survey  (PDHS) 2017-18,  23%  of ever-married  women \nreported  physical  violence,  26%  emotional  violence,  and  5%  sexual violence  from their \npartners.\n5\n The economic cost of violence against women and girls (VAWG) in Pakistan is \nestimated at $189.7 million annually, including $146 million in lost household income.\n6\n \n                                                            \n \n \n5\n  National Institute for Population Studies (NIPS). Pakistan Demographic and Health Survey (2017-2018). URL:",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 210,
            "to": 227
          }
        }
      }
    },
    {
      "id": 18,
      "content": "6\n \n                                                            \n \n \n5\n  National Institute for Population Studies (NIPS). Pakistan Demographic and Health Survey (2017-2018). URL: \nhttps://dhsprogram.com/pubs/pdf/FR354/FR354.pdf \n6\n  NCSW & UN WOMEN. National Report on the Status of Women, 2023. URL:",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 221,
            "to": 230
          }
        }
      }
    },
    {
      "id": 19,
      "content": "6 \n \n \n \n \n3. Women  face  numerous  obstacles  in  accessing  justice,  including  a  lack  of  female  police \nofficers (only 1.5% of the force), delays in First Information Report (FIR) registrations, and \ninadequate  police  investigations.\n7\n The  judicial  system,  often  influenced  by  patriarchal \nnorms,  further  hinders  justice  for  women.  For  instance,  although  11  rape  cases  are \nreported daily, this represents only 41% of actual incidents.\n8\n Of the reported cases, a mere \n18% progress to prosecution, with an extremely low conviction rate of 0.3%.\n9\n \n4. Deeply entrenched  patriarchal  norms  in  Pakistani society and  institutions,  including  the \njudiciary,  perpetuate  discrimination  against  women.  These  norms  manifest  in  various \nways,  from  judicial  attitudes  to  media  portrayals  that  reinforce  gender  stereotypes. \nWomen’s participation in public life, including journalism,  is  met  with  hostility  and",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 232,
            "to": 252
          }
        }
      }
    },
    {
      "id": 20,
      "content": "ways,  from  judicial  attitudes  to  media  portrayals  that  reinforce  gender  stereotypes. \nWomen’s participation in public life, including journalism,  is  met  with  hostility  and \nharassment, often exacerbated by right-wing extremist groups. \nExisting Frameworks and Actions \n1. Pakistan,  with  women  constituting  48.5%  of  its  population,  has  embedded  gender \nequality  within  its  Constitution.\n10\n Articles  8 to  28  guarantee  gender-neutral  rights, \nemphasizing equality and protection for all citizens. The Constitution promotes the active \nparticipation of women in all spheres of life. Pakistan’s commitment to advancing \nwomen's  rights  extends  beyond  its  borders, demonstrated  by  its  ratification  of  key \ninternational  agreements,  including  the  Convention  on  the  Elimination  of  All  Forms  of \nDiscrimination against Women (CEDAW), various International Labour Organization (ILO) \nconventions, and the Sustainable Development Goals (SDGs).",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 251,
            "to": 264
          }
        }
      }
    },
    {
      "id": 21,
      "content": "Discrimination against Women (CEDAW), various International Labour Organization (ILO) \nconventions, and the Sustainable Development Goals (SDGs). \n2. The country has established a comprehensive legal framework supporting women's rights, \nencompassing both affirmative actions and penal laws designed to protect and empower \nwomen. Significant federal legislation includes: \n Anti-Rape  (Investigation  and  Trial)  Act,  2021  which  aims  to  expeditiously  address  \ncrimes   of   sexual   violence   and   abuse,   by   providing   for   special   procedures   for \ninvestigation, evidence collection and trial, and by establishing or designating: Special \nCourts for separate trials, and  Anti-rape Crisis Cells \n Criminal Law (Amendment) Act, 2021 \n                                                            \n \n \nhttps://pakistan.unwomen.org/sites/default/files/2023-07/summary_-nrsw-inl_final.pdf \n \n7",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 263,
            "to": 278
          }
        }
      }
    },
    {
      "id": 22,
      "content": " Criminal Law (Amendment) Act, 2021 \n                                                            \n \n \nhttps://pakistan.unwomen.org/sites/default/files/2023-07/summary_-nrsw-inl_final.pdf \n \n7\n  War Against Rape & Aurat Foundation, Pakistan. Women’s Access to Justice in Pakistan. URL: \nhttps://www.ohchr.org/sites/default/files/documents/HRBodies/CEDAW/AccesstoJustice/AuratFoundationAndWarAgainst\nRape_Pakistan.pdf \n8\n  11 rape incidents reported in Pakistan every day, official statistics reveal. The News. Nov. 2020. URL: \nhttps://www.thenews.com.pk/latest/743328-about-11-rape-cases-reported-in-pakistan-every-day-official-statistics-reveal \n9\n  Id \n10\n  Pakistan Bureau of Statistics. Compendium on Gender Statistics - 2019.",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 272,
            "to": 288
          }
        }
      }
    },
    {
      "id": 23,
      "content": "7 \n \n \n \n \n The Enforcement of Women’s Property Rights Act, 2020 \n Protection Against Harassment of Women at Workplace Act, 2010 \n Criminal  Law (Amendment)  (Offense  in  the  Name  or  on  the  Pretext  of  Honor)  Act, \n2016 \n Criminal Law (Amendment) Act, 2018 (Anti-Rape Provisions) \nEach province has further supplemented these federal laws with its own legislation aimed \nat protecting women, such as the Punjab Protection of Women against Violence Act, 2016, \nand the Sindh Domestic Violence (Prevention and Protection) Act, 2013. \n3. Pakistan has also established several administrative structures to empower and protect \nwomen. These include: \n Benazir Income Support Program (BISP): Launched in 2008, BISP provides financial aid \nto approximately 8 million families, benefiting over 32 million individuals, with a focus \non  women's  empowerment  through  cash  transfers  to  improve  living  standards, \nhealth, and education.",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 290,
            "to": 308
          }
        }
      }
    },
    {
      "id": 24,
      "content": "to approximately 8 million families, benefiting over 32 million individuals, with a focus \non  women's  empowerment  through  cash  transfers  to  improve  living  standards, \nhealth, and education. \n Ombudsman  Offices:  These  offices,  operating  at  both  federal  and  provincial  levels, \naddress grievances related to women’s rights. \n Specialized Commissions: The National Commission on the Status of Women (NCSW), \nthe National Commission on the Rights of Child (NCRC), and other specialized bodies \nfocus on women’s issues. \n Women’s Shelters (Darul Amans): Around 103 shelters nationwide offer protection to \nwomen facing violence or abuse. \n Gender-Based Violence (GBV) Courts: Established to handle cases related to gender-\nbased violence, although their operational status remains inconsistent. \n4. Key  policy  interventions  have  been  implemented  to  enhance  women's  empowerment, \nincluding:",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 306,
            "to": 319
          }
        }
      }
    },
    {
      "id": 25,
      "content": "based violence, although their operational status remains inconsistent. \n4. Key  policy  interventions  have  been  implemented  to  enhance  women's  empowerment, \nincluding: \n Reserved  Seats  in  Legislatures:  Women  hold  17%–20%  of  reserved  seats  in  the \nNational Assembly, Senate, and provincial assemblies. \n National  Financial  Inclusion  Strategy  (NFIS):  Launched  in  2015,  the  NFIS  aims  to \nincrease women's access to financial services, including bank accounts. \n Digital  Financial  Services:  Initiatives  like  mobile  banking  and  digital wallets  target \nwomen in remote areas to improve their financial inclusion. \n Although  Pakistan  has  passed  numerous  laws  aimed  at  protecting  women,  the \nabsence of accompanying rules often renders these laws ineffective. For example, key \nlegislation such as the Juvenile Justice Act (2018), the Torture & Custodial Death Act",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 317,
            "to": 328
          }
        }
      }
    },
    {
      "id": 26,
      "content": "absence of accompanying rules often renders these laws ineffective. For example, key \nlegislation such as the Juvenile Justice Act (2018), the Torture & Custodial Death Act \n2022  and  the  Anti-Rape  (Investigation  and  Trial)  Act  (2021)  lack  the  necessary  rules \nfor implementation, weakening enforcement and reducing accountability. \nActions taken the National Commission for Human Rights",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 327,
            "to": 331
          }
        }
      }
    },
    {
      "id": 27,
      "content": "8 \n \n \n \n \n1. The National Commission for Human Rights (NCHR) has significantly advanced Pakistan's \ncompliance  with  the  International  Covenant  on  Civil  and  Political  Rights  (ICCPR)  by \naddressing key human rights issues, particularly related to Gender-Based Violence (GBV) \nand vulnerable communities. \n2. NCHR  has  processed  7,908  complaints,  including  1,271  suo  moto  actions,  with  around \n3,500 cases focused on GBV, women’s rights, and marital disputes. The commission \nensured  proper  police  registration  of  GBV cases,  provided  pro  bono  legal  aid  in  1,200 \ninstances, and referred numerous victims to shelters. NCHR’s gap analysis of Darul Amans \nled to improved shelter conditions across Pakistan.\n11\n \n3. NCHR  played a  crucial  role  in  securing a  life  sentence  for Usman Mirza  in  a  high-profile \nrape  case,  showcasing  its  commitment  to  justice.  The  commission  also  lobbied  for  a",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 333,
            "to": 350
          }
        }
      }
    },
    {
      "id": 28,
      "content": "3. NCHR  played a  crucial  role  in  securing a  life  sentence  for Usman Mirza  in  a  high-profile \nrape  case,  showcasing  its  commitment  to  justice.  The  commission  also  lobbied  for  a \ndomestic  violence  law  in  Islamabad,  which  is  currently  absent.  Additionally,  NCHR \nintervened  to  protect  transgender  rights  by  maintaining  the  third  gender  column  on \nCNICs, benefiting 50,000 registered transgender persons. \n4. During   the   2022   floods,   NCHR   advocated   for   gender-sensitive   relief   aligned   with \ninternational  standards.  The  commission  also  launched  a  helpline  (1413)  in  November \n2023,  receiving  348 calls  for  legal  advice  on  divorce,  child  custody,  and  maintenance. \nNCHR’s educational initiatives include MOUs with universities to integrate human rights \neducation, focusing on women’s rights. \nRecommendations:  \nThe NCHR submits the following recommendations to the Government of Pakistan (GoP):",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 349,
            "to": 360
          }
        }
      }
    },
    {
      "id": 29,
      "content": "education, focusing on women’s rights. \nRecommendations:  \nThe NCHR submits the following recommendations to the Government of Pakistan (GoP):  \n1. Tackle the root causes of gender-based violence by challenging cultural and social norms \nthat  support  violence  against  women  with  impunity.  Engage  men  in  advocacy  against \ndomestic  violence  by  promoting  positive  models  of  masculinity  and  ensuring  zero \ntolerance for misogyny, especially from those in power. \n2. Advocate for equitable posting of women in the public sector, particularly in leadership \nroles. For instance, despite qualified women in the district administration service, none \nare posted in field assignments in Sindh. Similarly, rectify discriminatory practices like the \ndenial of a female officer's appointment as Director General Hajj, where she was unfairly \nawarded zero marks in the interview by the Minister of Religious Affairs.",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 358,
            "to": 369
          }
        }
      }
    },
    {
      "id": 30,
      "content": "denial of a female officer's appointment as Director General Hajj, where she was unfairly \nawarded zero marks in the interview by the Minister of Religious Affairs. \n3. Pass specific domestic violence legislation in Islamabad Capital Territory (ICT) to establish \nan effective grievance redressal mechanism for victims. \n                                                            \n \n \n11\n  NCHR et al. More than Shelter: Needs Assessment of Dar ul Amans and Shelters in Pakistan.2023. URL: \nhttps://www.nchr.gov.pk/wp-content/uploads/2023/12/More-Than-Shelter.pdf",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 368,
            "to": 377
          }
        }
      }
    },
    {
      "id": 31,
      "content": "9 \n \n \n \n \n4. Improve  coordination among helplines, shelters, and  legal  aid  facilities. Ensure  that  the \nLaw  and  Justice  Commission  and  Legal  Aid  Authority  are  fully  utilized  to  provide  legal \nassistance to victims. \n5. Address  the  inadequacies  in  the  103  women's  shelters  across  Pakistan,  particularly  in \nBalochistan  and  Khyber  Pakhtunkhwa,  where  only  five  shelters  exist  each.  Increase \nbudgets, update operations, and standardize protocols to ensure these shelters function \neffectively. \n6. Implement public awareness campaigns, school programs, and community interventions \nto educate both women and men, law enforcement, and the judiciary on women's rights \nand the importance of gender equality. \n7. Synchronize the Anti-Rape (Crises Cell and Medico-Legal) Rules 2022 with existing Police \nRules and Code of Criminal Procedure, 1898. Ensure timely and professional collection of",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 379,
            "to": 395
          }
        }
      }
    },
    {
      "id": 32,
      "content": "7. Synchronize the Anti-Rape (Crises Cell and Medico-Legal) Rules 2022 with existing Police \nRules and Code of Criminal Procedure, 1898. Ensure timely and professional collection of \nevidence,  supported  by  adequate  funding for crime  scene  and  forensic equipment. The \ncurrent  status  of  the  cells  operationalization  indicates  progress  in  several  critical  areas, \nsuch  as  increased  reporting  of  sexual violence  cases  and  the  systematic  recording  of \ngeographically  segregated  data.  The  facility  provides  essential  services,  including  a \ndedicated  landline  for  the  medico-legal  office,  24/7  security,  and  access  to  relevant \nmedical departments. However, significant gaps remain that hinder full compliance with \nthe  Anti-Rape  Act  2021.The  absence  of  dedicated  human  resources—specifically  a \nreceptionist,  female  Medico-Legal  Officers  (MLOs),  and  data  management  personnel—",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 394,
            "to": 403
          }
        }
      }
    },
    {
      "id": 33,
      "content": "the  Anti-Rape  Act  2021.The  absence  of  dedicated  human  resources—specifically  a \nreceptionist,  female  Medico-Legal  Officers  (MLOs),  and  data  management  personnel—\nare   critical   shortcomings.   Additionally,   the   lack   of   structured   consent   procedures \nunderscores the need for improvements in both documentation and the safeguarding of \nsurvivor privacy. \n8. Provide  training  for  judges  on  gender  issues,  the  impact  of  domestic  violence,  and \nPakistan's  international  commitments  to  ensure  judicial  decisions  align  with  global \nstandards for protecting women's rights. \nFreedom of Conscience and Religious Belief (Articles 2, 18, and 26) \n1. Pakistan  is  a  country  of  immense  religious  and  ethnic  diversity,  home  to  communities \nfrom various faiths and cultural backgrounds. The Constitution of Pakistan enshrines the \nprinciples of equality and non-discrimination, ensuring that every individual, regardless of",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 402,
            "to": 413
          }
        }
      }
    },
    {
      "id": 34,
      "content": "from various faiths and cultural backgrounds. The Constitution of Pakistan enshrines the \nprinciples of equality and non-discrimination, ensuring that every individual, regardless of \ntheir  religion,  enjoys  equal  rights  and  protection  under  the  law.  However,  despite  this \nconstitutional promise, the lived experiences of many minority groups in Pakistan reveal \na significant disparity between the legal framework and reality. \n2. In recent years, there has been a disturbing increase in violence and discrimination against \nminority communities. Between 2023 and 2024, the Ahmadiyya community faced at least \n35  attacks  on  their  places  of  worship,  with  21  Ahmadis  arrested  on  various  religious",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 412,
            "to": 419
          }
        }
      }
    },
    {
      "id": 35,
      "content": "10 \n \n \n \n \ncharges. \n12\n Moreover, at least 136 cases of alleged forced conversions were reported in \n2023, predominantly targeting Hindu women and girls in Sindh.\n13\n \n3. The  situation  is  particularly  dire  in  Punjab  and  Sindh,  where  incidents  against  minority \ncommunities  surged  to  142  in  Punjab  and  47  in  Sindh  in  2023  alone.\n14\n This  upsurge  is \nconcerning,  especially  in  provinces  previously  known  for  relatively  fewer  terrorism-\nrelated incidents. \n4. A  significant  driver  of  this  crisis  is  the  misuse  of  blasphemy  laws,  which  are  frequently \nused to incite violence against minority groups. This abuse has created an environment of \nlawlessness,  fostering  vigilante  justice  due  to  widespread  distrust  in  the  justice  system. \nThe situation is further exacerbated by socio-economic frustrations, lack of education, and \ndeep-seated prejudices. The Commission is deeply concerned by the exponential rise in",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 421,
            "to": 442
          }
        }
      }
    },
    {
      "id": 36,
      "content": "The situation is further exacerbated by socio-economic frustrations, lack of education, and \ndeep-seated prejudices. The Commission is deeply concerned by the exponential rise in \nthe number of persons incarcerated under blasphemy charges (705 as of June 21, 2024), \nthe upholding of  due  process  and  allegations  of  entrapment  of  young  persons  under \ncybercrime laws.  \n5. Recent lynching’s,  attacks  on  churches,  and  other  violent  incidents  underscore  the \nseverity of religious and ethnic violence in Pakistan. These events, coupled with ongoing \ndiscrimination and harassment, reveal a profound failure in the public's confidence in the \njustice system and the effectiveness of accountability measures. \n6. Barriers to justice for marginalized communities, pervasive online hate speech, and issues \nsuch as bonded labor and violence against women remain pressing concerns. While there \nhas been some progress in condemning hate speech and religious violence, a significant",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 441,
            "to": 452
          }
        }
      }
    },
    {
      "id": 37,
      "content": "such as bonded labor and violence against women remain pressing concerns. While there \nhas been some progress in condemning hate speech and religious violence, a significant \ngap remains in achieving meaningful societal change. \nExisting Frameworks and Efforts  \n1. The  Government  of  Pakistan  has  made  several  attempts  to  safeguard  the  rights  of \nminority groups and ensure their political representation. The Constitution reserves seats \nfor religious minorities in both the National and Provincial Assemblies, ensuring their voice \nin  legislative  processes.  Significant  appointments  of  minorities  to  ministerial  positions, \nsuch  as  Krishna  Kumari  as  a  senator  and  Mahesh  Kumar  Malani  as  a  Member  of  the \nNational  Assembly,  reflect  these  efforts.  Moreover,  the  government  has  taken steps  to \nrestore and protect religious sites belonging to minorities, such as the renovation of the \nKatas Raj Temples and the Kartarpur Corridor project.",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 451,
            "to": 462
          }
        }
      }
    },
    {
      "id": 38,
      "content": "restore and protect religious sites belonging to minorities, such as the renovation of the \nKatas Raj Temples and the Kartarpur Corridor project. \n                                                            \n \n \n12\n  See NCHR, Situation Report: Monitoring the Plight of the Ahmadiyya Community. 2024. URL: https://nchr.gov.pk/wp-\ncontent/uploads/2024/04/Ahmadiya-Report.pdf \n13\n  US Dept of State. 2023 Report on International Religious Freedom Pakistan. \n14\n  Id",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 461,
            "to": 472
          }
        }
      }
    },
    {
      "id": 39,
      "content": "11 \n \n \n \n \n2. In addition to these efforts, the government has enacted several laws aimed at protecting \nthe rights of minorities: \n Constitution  of  Pakistan  (1973):  Articles  20,  21,  22,  25,  26,  27,  33,  and  36  provide \ncomprehensive   protections,   including   the   freedom   to   profess   religion,   non-\ndiscrimination in public spaces, and protection of minority rights. \n Pakistan  Penal Code  (1860):  Sections  153-A  and  295-A  criminalize  acts  promoting \nenmity  between  different  groups  and  malicious  acts  intended  to  outrage  religious \nfeelings. \n The  Protection against Harassment  of  Women  at  the  Workplace  Act  (2010):  While \nprimarily  focused  on  gender  discrimination,  it  also  addresses  broader  issues  of \nharassment and discrimination. \n The  Sindh  Hindu  Marriage  Act  (2016)  and  The  Khyber  Pakhtunkhwa  Protection  of \nCommunal Properties of Minorities Act (2014): Provide legal protections for religious",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 474,
            "to": 491
          }
        }
      }
    },
    {
      "id": 40,
      "content": " The  Sindh  Hindu  Marriage  Act  (2016)  and  The  Khyber  Pakhtunkhwa  Protection  of \nCommunal Properties of Minorities Act (2014): Provide legal protections for religious \nminorities,  including  safeguarding  communal  properties  and  formalizing  marriage \nrights. \n The Criminal Law (Amendment) Act (2017): Enhances penalties for offenses motivated \nby racial or religious hatred. \n  Anti-Terrorism Act (1997) and Prevention of Electronic Crimes Act (2016): Address the \nincitement of violence and dissemination of hate speech. \n Sikh Marriage Act (2024): Enables legal recognition of Sikh marriages and divorces. \nActions taken by the National Commission for Human Rights  \n1. The National Commission for Human Rights (NCHR) has played a pivotal role in addressing \nthe  challenges  faced  by  religious  and  ethnic  minorities  in  Pakistan.  Below  are  the  key \ninitiatives undertaken by the NCHR to uphold and protect the rights of minorities:",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 490,
            "to": 502
          }
        }
      }
    },
    {
      "id": 41,
      "content": "the  challenges  faced  by  religious  and  ethnic  minorities  in  Pakistan.  Below  are  the  key \ninitiatives undertaken by the NCHR to uphold and protect the rights of minorities: \n Complaints   were   received regarding   government   job   advertisements   targeting \nChristians and Hindus exclusively for sanitary worker positions. NCHR demanded that \nthe government ban discriminatory advertisements in public job advertisements and \na nationwide ban was imposed. \n Published \"Unequal   Citizens:   Ending   System   Discrimination   against   Minorities,\" \nfocusing  on  the  conditions  of  sanitary  workers,  predominantly  from  Christian  and \nHindu  communities.  Recommendations  included  replacing  manual  unclogging  of \nsewers  with  machines,  providing adequate  Personal  Protective  Equipment  (PPE), \nensuring  living  wages  and  hazard  pay,  and  registering  workers  with  the  Employees' \nOld-Age Benefits Institution (EOBI).",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 501,
            "to": 512
          }
        }
      }
    },
    {
      "id": 42,
      "content": "ensuring  living  wages  and  hazard  pay,  and  registering  workers  with  the  Employees' \nOld-Age Benefits Institution (EOBI). \n Took suo motu notice of desecration of Ahmadi graves in Punjab. NCHR intervention \nled to registration of cases against 23 nominated and 15 unknown accused.",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 511,
            "to": 514
          }
        }
      }
    },
    {
      "id": 43,
      "content": "12 \n \n \n \n \n Following the lynching of a Sri Lankan citizen, Priyantha Kumara, in Sialkot, NCHR took \nsuo moto notice, conducted site inspections, and monitored the case, leading to the \nconviction  of  87 individuals  within  three  months,  setting  a  record  for  swift  justice \ndelivery. \n EmpowHER  Project,  aimed  at  protecting  the  rights  of  marginalized  women  through \nfootball and targeted communities such as Hazara women in Balochistan, Chitral and \nLyari, Karachi. The project addressed gender-based violence, access to public space, \nmental  health  challenges,  and  worked  to  build  confidence  and  resilience  among \nparticipants. \n Between December 2021 and June 2024, NCHR handled 189 cases related to minority \nrights, advocating for a minimum marriage age of 18, establishing a Marriage Rights \nHelpline  (1412),  taking  suo  motu  notices  of  forced  marriages  and  abductions,  and",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 516,
            "to": 532
          }
        }
      }
    },
    {
      "id": 44,
      "content": "rights, advocating for a minimum marriage age of 18, establishing a Marriage Rights \nHelpline  (1412),  taking  suo  motu  notices  of  forced  marriages  and  abductions,  and \nintervening  in  cases  of  desecration  of  religious  properties.  NCHR  interventions \nsecured the recovery of several minors abducted in forced conversion and marriage \nincluding a 12 year old girl from Rawalpindi, one child from Okara and a young woman \nfrom the Sikh community.  \n Numerous visits to jail and regular monitoring of individuals accused under blasphemy \nlaws, highlighting a significant increase of 6,300% in number of cases registered under \nblasphemy law over last three and a half year period \n Following the Jaranwala incident, NCHR's open letter to the Prime Minister led to the \nestablishment of a high-level investigation committee on religious harmony and the \nimmediate reconstruction of damaged churches and homes.",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 531,
            "to": 542
          }
        }
      }
    },
    {
      "id": 45,
      "content": "establishment of a high-level investigation committee on religious harmony and the \nimmediate reconstruction of damaged churches and homes.  \n Suo Moto intervention into Bashir Masih's case of custodial death led to the arrest of \npolice culprits in Sumbarial District, Sialkot \n Ensured enforcement of minimum wages for janitorial staff in following public sector \norganizations  such  as  Pakistan  Post  Office,  National  Savings,  Capital  Development \nAuthority, Cantonment Board, and National Institute of Health.  \n Held hearings to ensure the reclamation of encroached temple land in Narowal, and \nFatehjung.  \n Agitated  for  reform  in  the  Religious  Education  Curriculum  so  that  seven  religious \nminorities    (Bahai,    Buddhism,    Christianity,    Hinduism,    Kalash,    Sikhism    and \nZoroastrianism) could study their own faiths in school. \nRecommendations  \nThe National Commission for Human Rights submits the following recommendations to the",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 541,
            "to": 554
          }
        }
      }
    },
    {
      "id": 46,
      "content": "Zoroastrianism) could study their own faiths in school. \nRecommendations  \nThe National Commission for Human Rights submits the following recommendations to the \nGovernment of Pakistan (GoP):  \n1. Establish a comprehensive, all-party consensus policy to combat religious extremism. \nEngage  political  parties,  religious  groups,  and  stakeholders  to  create  a  cohesive",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 552,
            "to": 557
          }
        }
      }
    },
    {
      "id": 47,
      "content": "13 \n \n \n \n \nstrategy  that  addresses  growing  radicalism  and  hate  speech.  This  policy  should \nempower law enforcement to act decisively against extremists. \n2. Scrutinize  blasphemy cases,  especially  those  involving  young  individuals  and  cases \nunder  the  Prevention  of  Electronic  Crimes  Act  (PECA).  Train  first  responders  to \nrecognize mental health issues in accused individuals, and implement robust witness \nprotection laws to ensure fair trials. \n3. Ensure  transparency  and  fairness  in  the  implementation  of  minority  employment \nquotas.. \n4. Address  bonded  labour  by  improving  access  to  justice  for  affected  minorities. \nStrengthen  labor  unions,  expedite  brick  kiln  registrations,  incentivize  automated \nmachinery,  and  enhance  the  capacity  of  District  Vigilance  Committees.  Focus  on \naccurate data collection and prohibit child labour in brick kilns.",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 559,
            "to": 575
          }
        }
      }
    },
    {
      "id": 48,
      "content": "machinery,  and  enhance  the  capacity  of  District  Vigilance  Committees.  Focus  on \naccurate data collection and prohibit child labour in brick kilns. \n5. Develop  transparent  and  equitable  hiring  policies  for  minorities  at  all  government \nlevels... Provide access to justice and equal wages for minority employees. \n6. Implement  standard  operating  procedures  (SOPs)  for  investigating  religious  and \nethnic violence. Establish special prosecutors, fast-track courts, and specialized police \nunits  for  handling  minority  violence  and  blasphemy  cases.  Utilize  geofencing,  CCTV, \nand rapid response teams to enhance investigation and response capabilities. \n7. Importantly,  pursue  reforms  in  the  madrassa  education  system  as  outlined  in  the \nNational Action Plan 2015. Engage in nationwide consultations with religious groups \nto emphasize human rights and citizenship responsibilities, promoting a more tolerant",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 574,
            "to": 584
          }
        }
      }
    },
    {
      "id": 49,
      "content": "National Action Plan 2015. Engage in nationwide consultations with religious groups \nto emphasize human rights and citizenship responsibilities, promoting a more tolerant \nsociety. Ensure zero tolerance for false accusations of blasphemy and vigilante mob \naction. \n8. Enforce  the  directives  of  the  Justice  Jilani  Judgement  SMC1  of  2014.  Develop \nstrategies  for  religious  tolerance,  reform  school  curricula,  protect  places  of  worship \nand address online hate speech. \n9. Introduce and enforce comprehensive policies to combat hate speech both online and \noffline. Amend existing laws to effectively address hate speech while respecting free \nspeech. Strengthen reporting mechanisms and combat online hate using frameworks \nlike the Rabat Plan of Action and UN Charters. \n10. Launch nationwide awareness campaigns to foster a culture of tolerance and respect \nfor religious diversity. Educate the public on the dangers of hate speech and promote",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 583,
            "to": 595
          }
        }
      }
    },
    {
      "id": 50,
      "content": "10. Launch nationwide awareness campaigns to foster a culture of tolerance and respect \nfor religious diversity. Educate the public on the dangers of hate speech and promote \ncoexistence among different communities. \n11. Build police capacity to handle minority-related cases effectively. Establish specialized \ntask  forces  with  professional  training  to  protect  minority  places  of  worship  and \naddress community-specific challenges. \n12. Implement measures to curb radical ideologies that incite violence and undermine the \nrule  of  law.  Introduce  educational  reforms  and  awareness  programs  in  schools  and \nmadrasas to promote tolerance and inclusivity from a young age.",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 594,
            "to": 602
          }
        }
      }
    },
    {
      "id": 51,
      "content": "14 \n \n \n \n \nElimination of Slavery and Forced and Bonded Labor (arts. 2, 7, 8 and \n26) \n1. Pakistan  faces  a  significant  issue  with  modern  slavery,  with  approximately  3  million \nindividuals  trapped  in  conditions  of  forced  labor.\n15\n This  predominantly  includes  debt \nbondage, where individuals, typically male workers, secure loans or salary advances from \nemployers,  labor  contractors,  or  landlords.  These  workers  are  then  forced  to  labor  at \nreduced wages until their debts are repaid. This practice is particularly prevalent in sectors \nsuch as brick kilns, agriculture, and domestic work. \n2. The scope of bonded labor often extends to family members, with women and children \ncompelled  to  work  to  repay  debts  incurred  by  their  male  relatives.  This  inherited  debt \nperpetuates a cycle of bondage across generations. The lack of written contracts and legal",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 604,
            "to": 621
          }
        }
      }
    },
    {
      "id": 52,
      "content": "compelled  to  work  to  repay  debts  incurred  by  their  male  relatives.  This  inherited  debt \nperpetuates a cycle of bondage across generations. The lack of written contracts and legal \naid  exacerbates  the  vulnerability  of  these  laborers,  leaving  them  open  to  exploitation. \nAdditionally,  Pakistan's  fragile  economy  and  inefficiencies  in  the  judicial  system  deter \nformal   lending   practices,   contributing   to   the   persistence   of   bonded   labor.   Weak \nenforcement of social welfare programs and laws, combined with systemic discrimination \nand outdated labor laws, further perpetuate the exploitation of bonded laborers. \n3. In 2021, over 20,000 cases of bonded, forced, and child labor were reported, though many \ncases  likely go  unreported  due  to  the  fear  of  retaliation  and  lack  of  awareness  among \nvictims.\n16\n \nExisting Frameworks and Efforts",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 620,
            "to": 632
          }
        }
      }
    },
    {
      "id": 53,
      "content": "cases  likely go  unreported  due  to  the  fear  of  retaliation  and  lack  of  awareness  among \nvictims.\n16\n \nExisting Frameworks and Efforts \n1. Pakistan   ratified   several   key   International   Labour   Organization   (ILO)   conventions, \nincluding  those  on  the  Abolition  of  Forced  Labour  (Convention  No.  105)  and  the  Worst \nForms of Child Labour (Convention No. 182).Pakistan’s Constitution and various laws \nprovide  a  framework  to  address  issues  of  slavery,  forced  labor,  and  human  trafficking. \nNotably, Article 11 of the Constitution explicitly prohibits slavery, forced labor, and human \ntrafficking. Additionally, the Bonded Labor System (Abolition) Act of 1992 was enacted to \noutlaw bonded labor and nullify any existing debts tied to this practice. \n2. The  Pakistani  government  has  introduced  several  key  laws  and  policies  to  combat \ntrafficking  and  forced  labor.  The  Prevention  of  Trafficking  in  Persons  Act  (PTPA)  2018",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 628,
            "to": 641
          }
        }
      }
    },
    {
      "id": 54,
      "content": "2. The  Pakistani  government  has  introduced  several  key  laws  and  policies  to  combat \ntrafficking  and  forced  labor.  The  Prevention  of  Trafficking  in  Persons  Act  (PTPA)  2018 \n                                                            \n \n \n15\n  Modern slavery: Pakistan’s latest climate change curse. Al jazeera. Sept 2023. URL: \nhttps://www.aljazeera.com/opinions/2023/9/1/modern-slavery-pakistans-growing-climate-change-curse \n16\n  Breaking The Chains: How To Tackle Bonded Labour in Pakistan?. FES Asia. 14.08.2023. URL: \nhttps://asia.fes.de/news/breaking-the-chains-of-bonded-labour-in-pakistan.html",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 640,
            "to": 650
          }
        }
      }
    },
    {
      "id": 55,
      "content": "15 \n \n \n \n \ncriminalizes  both  labor  and  sex  trafficking,  stipulating  penalties  that  range  up  to  seven \nyears' imprisonment and fines for trafficking involving adult male victims, and up to ten \nyears'  imprisonment  and  fines  for  crimes  involving  female  or  child  victims.  Another \nsignificant piece of legislation is the  Federal Bonded Labor System Abolition Act (BLSA), \nwhich  imposes  penalties  of  two  to  five  years' imprisonment  and  fines  for  individuals \nengaged in bonded labor. \n3. Efforts to enforce these laws have been substantial. In 2021, the government conducted \ninvestigations  into  1,936  trafficking  cases,  which  included  856  cases  related  to  sex \ntrafficking and 988 cases of forced labor. Of these investigations, 1,236 individuals were \nprosecuted under the PTPA, and 105 traffickers were convicted. The Federal Investigative \nAgency  (FIA)  has  played  a  crucial  role  in  these  efforts,  allocating  1.07  billion  PKR",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 652,
            "to": 667
          }
        }
      }
    },
    {
      "id": 56,
      "content": "prosecuted under the PTPA, and 105 traffickers were convicted. The Federal Investigative \nAgency  (FIA)  has  played  a  crucial  role  in  these  efforts,  allocating  1.07  billion  PKR \n(approximately $4.73 million) for investigations and employing 781 personnel dedicated \nto trafficking and migrant smuggling.\n17\n \n4. Despite  these  substantial  efforts,  significant  challenges  persist.  Training  deficiencies \nremain  a  major  issue,  as  labor  inspectors  often  lack adequate  training  and  resources, \nwhich limits their effectiveness. For instance, while Punjab conducted over 53,000 child \nlabor  inspections  in  2022,  the  enforcement  faced  notable  challenges.\n18\n Additionally, \ncoordination  issues  between  federal  and  provincial  agencies  have  hindered  effective \nenforcement, illustrating a need for improved collaboration and streamlined efforts. \nActions Taken by the National Commission for Human Rights (NCHR)",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 666,
            "to": 680
          }
        }
      }
    },
    {
      "id": 57,
      "content": "enforcement, illustrating a need for improved collaboration and streamlined efforts. \nActions Taken by the National Commission for Human Rights (NCHR) \n1. The National Commission for Human Rights (NCHR) has undertaken extensive field visits \nand  consultations  in  Punjab,  a  region  known  for  its  significant  issue  with  bonded  labor, \nparticularly  in  brick  kilns.  The  2023  report  produced  by  NCHR  reveals  the  widespread \nexploitation  of  bonded  laborers  and  identifies  critical  issues  such as local authorities’ \ncomplicity and inadequate monitoring mechanisms.\n19\n \n2. The NCHR’s 2023 report emphasizes the need for comprehensive reforms to address \nbonded  labor.  Key  recommendations  include  improving  access  to  justice  by  enhancing \nlegal  support  and  resources  for  bonded  laborers,  and  strengthening  labor  unions  to \nprotect  workers'  rights.  The  report  also  calls  for  a  revision  of  brick  kiln  registration",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 679,
            "to": 691
          }
        }
      }
    },
    {
      "id": 58,
      "content": "legal  support  and  resources  for  bonded  laborers,  and  strengthening  labor  unions  to \nprotect  workers'  rights.  The  report  also  calls  for  a  revision  of  brick  kiln  registration \nprocesses   to   make   them   more   efficient   and   incentivize   compliance.   Additionally, \n                                                            \n \n \n17\n  US Dept of State. 2023 Trafficking in Persons Report. URL: https://www.state.gov/reports/2023-trafficking-in-persons-\nreport/pakistan \n18\n  US Dept of Labor. 2022 Findings of the Worst Form of Child Labor Pakistan. URL: \nhttps://www.ecoi.net/de/dokument/2098538.html \n19\n National Commission for Human Rights. 2023. The Issue of Bonded Labour in Pakistan. URL: https://nchr.gov.pk/wp-\ncontent/uploads/2023/08/The-Issue-of-Bonded-Labour-in-Pakistan.pdf",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 690,
            "to": 704
          }
        }
      }
    },
    {
      "id": 59,
      "content": "16 \n \n \n \n \npromoting the use of automated machinery in brick production is suggested as a way to \nreduce dependence on manual labor. \n3. The NCHR has outlined several specific recommendations such as enhancing the capacity \nof  District  Vigilance  Committees  (DVCs)  which  are  crucial  for  effective  enforcement  of \nanti-bonded  labor  laws.  Improving  data  collection  through  mobile  units  for  registration \nand better data management is also recommended. The report advocates for promoting \nethical  buying  practices  in  brick  procurement  and  calls  for  the  facilitation  of  training \nprograms for relevant organizations and officials. \n4. In  its  report  on  irregular  migration,  titled  \"Perilous  Journeys: Unravelling Irregular \nMigration  from  Pakistan,\"  the  NCHR  highlights  the  severe  risks  faced  by  migrants, \nincluding   exploitation   and   trafficking.   The   report   suggests   establishing   dedicated",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 706,
            "to": 721
          }
        }
      }
    },
    {
      "id": 60,
      "content": "Migration  from  Pakistan,\"  the  NCHR  highlights  the  severe  risks  faced  by  migrants, \nincluding   exploitation   and   trafficking.   The   report   suggests   establishing   dedicated \nawareness  units  in  areas  prone  to  smuggling,  creating  specialized  investigation units  at \nthe  district  level,  and  improving  coordination  among  stakeholders  to  enhance  data \nsharing and response efforts. \n5. In collaboration with the International Organization for Migration (IOM) and the Embassy \nof Denmark, the NCHR is actively engaged in strategic outreach initiatives. These efforts \naim to disseminate findings and raise awareness at the provincial level. Launch events in \nLahore and Karachi are being organized to address local challenges and develop effective \nsolutions for the issues related to irregular migration and human trafficking. \nRecommendations  \nThe National Commission for Human Rights submits the following recommendations to the \nGovernment of Pakistan (GoP):",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 720,
            "to": 732
          }
        }
      }
    },
    {
      "id": 61,
      "content": "Recommendations  \nThe National Commission for Human Rights submits the following recommendations to the \nGovernment of Pakistan (GoP):  \n1. Promptly enforce the Children (Pledging of Labor) Act, 1933, the Employment of Children \nAct, 1991, and the Bonded Labor (Abolition) Act, 1992. Ensure that bonded laborers’ past \ndebts are terminated and that vigilance committees fulfil their responsibilities effectively. \nEmployers  previously  engaged  in  bonded  labor  should  be  prohibited  from  serving  on \nthese committees. \n2. Establish a dedicated police force to enforce labor laws, with a specific focus on bonded \nlabor. Ensure this force is adequately trained and resourced. \n3. Guarantee  that  workers  in  all  sectors,  including  agriculture,  carpet-weaving,  and  brick \nproduction,  have  the  right  to  organize  and  be  represented  by  unions  for  collective \nbargaining. Redefine “essential” economic activities to apply only to truly strategic areas",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 730,
            "to": 742
          }
        }
      }
    },
    {
      "id": 62,
      "content": "production,  have  the  right  to  organize  and  be  represented  by  unions  for  collective \nbargaining. Redefine “essential” economic activities to apply only to truly strategic areas \nand ensure union rights are protected even in these sectors. \n4. Order prompt, impartial investigations of violations of the Bonded Labor (Abolition) Act. \nPublicize the cancellation of debts  being \"repaid\" by bonded laborers and make it clear \nthat such debts are null and void.",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 741,
            "to": 746
          }
        }
      }
    },
    {
      "id": 63,
      "content": "17 \n \n \n \n \n5. Vigorously prosecute employers involved in bonded labor and those who abuse laborers. \nHold state officials and police officers accountable if they fail to enforce laws or cooperate \nwith  employers  to  maintain  servitude.  Consider  increasing  penalties,  making  offenses \nnon-bailable for repeat offenders, multiple victims, or cases involving violence. \n6. Guarantee  that  bonded  laborers  can  exercise  their  right  to  freedom  of  movement,  live \nwhere they choose, and return to their villages without restriction. \n7. Repeal Section 7 of the Electoral Rolls Act, 1974, which denies bonded laborers the right \nto vote, ensuring their full participation in the democratic process. \n8. Connect bonded laborers to national and provincial social safety-net programs and ensure \neffective functioning of District Vigilance Committees for the eradication of bonded labor. \n9. Develop  alternative  employment  opportunities  in  the  formal  economy  for  bonded",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 748,
            "to": 763
          }
        }
      }
    },
    {
      "id": 64,
      "content": "effective functioning of District Vigilance Committees for the eradication of bonded labor. \n9. Develop  alternative  employment  opportunities  in  the  formal  economy  for  bonded \nlaborers and those at risk of bonded labor. This should be a core element of policies aimed \nat reducing the informal economy. Enhance availability of affordable credit to decrease \nreliance on advances from employers, which often lead to bondage. \n10. Launch extensive campaigns to inform the public about the illegality of bonded labor and \nbuild demand for its abolition. Conduct programs for women, adolescent girls, and boys \nto recognize signs of forced marriage or trafficking. Engage the media to expand coverage \non modern slavery issues and their impact on citizens' rights. \n11. Encourage trade unions to address bonded labor in their organizing efforts and develop \ncomprehensive strategies for supporting bonded laborers.",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 762,
            "to": 772
          }
        }
      }
    },
    {
      "id": 65,
      "content": "11. Encourage trade unions to address bonded labor in their organizing efforts and develop \ncomprehensive strategies for supporting bonded laborers. \n12. Continue  to  enhance  the  skills  and  resources  of  government  officials  and  functionaries \ninvolved   in   abolishing   bonded   labor,   ensuring   effective   law   enforcement.   Provide \nreintegration   support   for   victims   through   economic   inclusion,   skill   development, \nvocational training, and educational outreach programs. \n13. Establish processing facilities for human trafficking victims at ports and airports, building \non  existing  UNODC  assistance.  Improve  mechanisms  for  identifying  trafficked  children, \ncollaborating  with  child  protection  cells.  Enhance  the  capabilities  of  provincial  police \nforces to address internal trafficking effectively. \nProhibition   of   torture   and   other   cruel,   inhuman   or degrading",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 771,
            "to": 781
          }
        }
      }
    },
    {
      "id": 66,
      "content": "forces to address internal trafficking effectively. \nProhibition   of   torture   and   other   cruel,   inhuman   or degrading \ntreatment  or  punishment,  and  treatment  of  persons  deprived  of \ntheir liberty (arts. 7, 9 and 10) \n1. In its Concluding Observations, the Committee expressed concern that the Government \nof Pakistan has neither defined “torture” nor criminalized the act of torture in compliance \nwith international standards. Specifically, it mentioned that “torture is allegedly widely \nemployed by the police, military and security forces and intelligence agencies; and that \nallegations of torture are not promptly and thoroughly investigated, and perpetrators are \nrarely brought to justice.”",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 780,
            "to": 789
          }
        }
      }
    },
    {
      "id": 67,
      "content": "18 \n \n \n \n \n2. Torture  continues  to  be  accepted  as  an  inevitable  part  of  law  enforcement  in  Pakistan, \nand perpetrators of torture are granted impunity through a combination of socio-cultural \nacceptance, lack  of  independent  oversight  and  investigation  mechanisms,  widespread \npowers of arrest and detention, procedural loopholes and ineffective safeguards.  \n3. Torture  in  Pakistani  prisons  is  also  common.  The  NCHR  has  reported  that  26  people  in \ndetention  alleged they  experienced  torture  and  inhuman  and  degrading  treatment  of \ndifferent types during NCHR’s visit to the Adiala Jail in Rawalpindi.\n20\n \n4. The  Committee,  in  its  2017  Concluding  Observations  also  expressed  concern  over \novercrowding  and  inadequate  detention  conditions  in  Pakistani  prisons,  as  well  as  the \nhigh  proportion  of  persons  held  in  prolonged  pre-trial  detention.  It  also  recommended",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 791,
            "to": 807
          }
        }
      }
    },
    {
      "id": 68,
      "content": "overcrowding  and  inadequate  detention  conditions  in  Pakistani  prisons,  as  well  as  the \nhigh  proportion  of  persons  held  in  prolonged  pre-trial  detention.  It  also  recommended \nthat Pakistan “intensify its efforts to reduce prison overcrowding and improve the \nconditions of detention, particularly health care and hygiene” and use pre-trial detention \nonly in exceptional cases and not for long periods of time.  \n5. Pakistan’s  prisons  continue  to  be  “notoriously  unsanitary.”\n21\n In   March   2020,   the \nIslamabad High Court noted in a judgment the “unprecedented and grave  conditions \nprevailing in the prisons across the country” and said that the “living conditions and \ntreatment  of  prisoners  in  overflowing  and  inadequately  equipped  prisons  has  raised \nserious constitutional and human rights concerns.”\n22\n The  court  concluded that, “A \nprisoner who is held in custody in an overcrowded prison, having lack of sanitation, [is]",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 806,
            "to": 820
          }
        }
      }
    },
    {
      "id": 69,
      "content": "serious constitutional and human rights concerns.”\n22\n The  court  concluded that, “A \nprisoner who is held in custody in an overcrowded prison, having lack of sanitation, [is] \ntantamount to cruel and inhuman treatment for which the State ought to be accountable \nbecause it amounts to a breach of fiduciary duty of care.” \n6. The NCHR at both the federal and provincial levels has conducted visits to prisons in all \nprovinces. Its findings reflect the grave issue of overcrowding in prisons which was further \nexacerbated during the COVID-19 pandemic. The visit to the District Jail Lahore found that \nthe  prison  had  a  capacity  of  2,000  individuals,  however,  3,814  prisoners  were  housed \nthere which led to issues of ventilation, lack of medical facilities and equipment including \ntransportation.  It  has  also  been  reported  that  the  number  of under  trial prisoners \ncontinues  to  increase  prison  populations,  which  without  an  increase  in  resources,",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 817,
            "to": 829
          }
        }
      }
    },
    {
      "id": 70,
      "content": "transportation.  It  has  also  been  reported  that  the  number  of under  trial prisoners \ncontinues  to  increase  prison  populations,  which  without  an  increase  in  resources, \nexacerbates current human rights inequalities and violations. In Karachi and Lahore, out \nof 4,181 prisoners, 3,410 are under trial.\n23\n This is almost 82% of the prison population in \nthese two jails. \n                                                            \n \n \n20\n  National Commission for Human Rights. 2022. Report on torture at Adiala jail. URL: https://www.nchr.gov.pk/wp-\ncontent/uploads/2022/11/Report-on-Torture-at-Adiala-Jail.pdf \n21\n  Human Rights Watch. A nightmare for everyone: The Health Crisis in Pakistan’s prisons. 2023. URL: \nhttps://www.hrw.org/report/2023/03/29/nightmare-everyone/health-crisis-pakistans-prisons \n22\n  Id \n23\n  National Commission for Human Rights. 2022. Submission to the Universal Periodic Review. URL:",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 828,
            "to": 847
          }
        }
      }
    },
    {
      "id": 71,
      "content": "https://www.hrw.org/report/2023/03/29/nightmare-everyone/health-crisis-pakistans-prisons \n22\n  Id \n23\n  National Commission for Human Rights. 2022. Submission to the Universal Periodic Review. URL:  \nhttps://www.nchr.gov.pk/wp-content/uploads/2023/09/NCHR-UPR-Report.pdf",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 843,
            "to": 848
          }
        }
      }
    },
    {
      "id": 72,
      "content": "19 \n \n \n \n \n7. The  Report  on  Prison  Reform  by  the  Ministry  of  Human  Rights  (MoHR)  highlights \nsignificant gaps in Pakistan's Prison Rules when compared to international standards like \nthe Mandela Rules and Bangkok Rules.\n24\n The report reveals that the Prison Rules do not \nsufficiently emphasize the dignity of prisoners, lack electronic management systems, and \nfail to mandate the timely transfer of prisoners to their home districts, which only occurs \n30 days before release. Additionally, while prisoners are initially screened for physical and \nmental  health  issues,  the  report  notes  a  concerning  lack  of  ongoing  medical  treatment \nthroughout their incarceration. These findings underscore the urgent need for reforms to \nalign Pakistan's prison system with international human rights norms. \nExisting Framework and Efforts  \n1. In  October  2022,  the  Government  passed  the  Torture  and  Custodial  Death  (Prevention",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 850,
            "to": 867
          }
        }
      }
    },
    {
      "id": 73,
      "content": "Existing Framework and Efforts  \n1. In  October  2022,  the  Government  passed  the  Torture  and  Custodial  Death  (Prevention \nand Punishment) Act which defines and criminalizes torture, and imposes sanctions and \npunishment  for  public  servants  who  employ  torture.  The  Act  “provide[s]  for  the \nprevention of all acts of torture, custodial death and custodial rape perpetrated by public \nservants or any person acting in an official capacity. \n2. The   Federal   Investigation Agency   (FIA)   holds   exclusive   jurisdiction   to   investigate \ncomplaints against public officials, however Sec 5 of the Act gives NCHR supervision over \nthe FIA.  More than a year since the passage of the Act, however no functional wing has \nbeen  set  up  dedicated to  investigating  custodial  torture,  and  there  is  no  complaint \nmechanism for such cases on FIA’s official website, unlike for all other federal offences \nfalling under its ambit.\n25",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 866,
            "to": 878
          }
        }
      }
    },
    {
      "id": 74,
      "content": "mechanism for such cases on FIA’s official website, unlike for all other federal offences \nfalling under its ambit.\n25\n Additionally, the rules for the Torture Act have not been finalised.  \n3. The Constitution of Pakistan under Article 14(2) prohibits the use of torture in extracting \nevidence. Article 156(d) of the Police Order 2002 also establishes penalties for those who \ninflict  torture  or  violence  on  any  person  in custody.  Similar to  the  Police  Order,  2002, \nsection 119 of the KP Police Act, 2017 and section 156 of the Sindh (Repeal Of The Police \nAct,  1861  And  Revival  Of  Police  Order,  2002)  (Amendment)  Act,  2019  also  criminalise \ntorture  and  other  police  excesses.  In  addition,  section  36  of  the  Sindh  Police  Act,  2019 \nprovides an oversight mechanism outside the police hierarchy to impose a check on cases \nof police excesses including torture. \n                                                            \n \n \n24",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 876,
            "to": 891
          }
        }
      }
    },
    {
      "id": 75,
      "content": "provides an oversight mechanism outside the police hierarchy to impose a check on cases \nof police excesses including torture. \n                                                            \n \n \n24\n  Ministry of Human Rights. Report by the Commission Constituted by the Islamabad High Court in W.P 437 of 2017: \nPrison Reforms in Pakistan. URL: https://mohr.gov.pk/siteimage/misc/files/prisonsreforminpakistan.pdf \n25\n  NCHR and JPP. Gap Analysis: Torture and Custodial Death (Prevention and Punishment) Act, 2022: URL: \nhttps://jpp.org.pk/report/gap-analysis-torture-and-custodial-death-prevention-and-punishment-act-2022/",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 886,
            "to": 896
          }
        }
      }
    },
    {
      "id": 76,
      "content": "20 \n \n \n \n \n4. Since the 2017 Concluding Observations, Pakistan also promulgated the Punjab Probation \nand Parole Service Act 2019 and the Sindh Prisons and Corrections Services Act 2019 to \nsafeguard prisoner’s rights. The Sindh prison rules have been notified in 2020 which \ncomply with the minimum requirement set by the Bangkok Rules, however the remaining \nprovinces  and  the  federal  government  are  behind  in  reviewing  the  Prisons  Act  or  its \naccompanying  rules.  The  Sindh  Prisons  and  Corrections  Services  Act  seeks,  in  part,  to \ntransform prisons into more rehabilitative spaces. \nActions taken by the National Commission for Human Rights  \n1. The NCHR received a total of 1,305 cases from 2018 to 2022. \n2. NCHR investigated allegations of torture at Central Jail (Adiala), Rawalpindi at the behest \nof Chief Justice Athar Minallah on the basis of a complaint of custodial torture filed by Ms.",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 899,
            "to": 914
          }
        }
      }
    },
    {
      "id": 77,
      "content": "2. NCHR investigated allegations of torture at Central Jail (Adiala), Rawalpindi at the behest \nof Chief Justice Athar Minallah on the basis of a complaint of custodial torture filed by Ms. \nImtiaz  Bibi  before  the  Islamabad  High  Court.  Following  multiple  visits  to  the  jail  to \ninvestigate and meet with inmates, NCHR prepared an inquiry report for the Islamabad \nHigh  Court.  During  the  inquiry,  the  NCHR  came  across  numerous  instances  of  torture \nagainst  the  individuals  held  in  the  Rawalpindi  Jail.  Of  the  35  people  deprived  of  their \nliberty who were interviewed, 26 or 74% spoke about instances of torture. All spoke about \nfinancial extortion for provision of basic necessities in jail. Methods of torture ranged from \nphysical beatings with a rubber tire to solitary confinement.\n26\n \n3. Following the inquiry report, action was taken against officials working within Adiala Jail:",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 913,
            "to": 924
          }
        }
      }
    },
    {
      "id": 78,
      "content": "physical beatings with a rubber tire to solitary confinement.\n26\n \n3. Following the inquiry report, action was taken against officials working within Adiala Jail: \nseven officials were removed from service; four officials were suspended for 90 days; and \n38 officials were transferred out of Adiala Jail. A complaint cell and oversight committee \nwere  set  up  for  Adiala  Jail  (notified  by  NCHR)  to inquire  into  complaints  of torture. \nFollowing the  inquiry  report,  the  NCHR  also  prepared  a  manual  for  police  and  medico-\nlegal  examiners  on  the  best  practices  of  investigating  torture  complaints  based  on \ndomestic law and international standards.  \n4. Through pro bono legal support, NCHR was able to secure the release of 100+ juveniles \nwho had been incarcerated at Rawalpindi and Quetta jails \nRecommendations  \n                                                            \n \n \n26",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 921,
            "to": 937
          }
        }
      }
    },
    {
      "id": 79,
      "content": "who had been incarcerated at Rawalpindi and Quetta jails \nRecommendations  \n                                                            \n \n \n26\n See Khadim Husssain v. Secretary, Ministry of Human Rights (IHC Prison Reforms case), Writ Petition No. 4037 of 2019, \nIslamabad High Court, per Chief Justice Athar Minahllah, Mar. 14, 2020, \nhttp://mis.ihc.gov.pk/attachments/judgements/WP-4037-2019__________________637216920356707546.pdf",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 932,
            "to": 940
          }
        }
      }
    },
    {
      "id": 80,
      "content": "21 \n \n \n \n \nThe National Commission for Human Rights submits the following recommendations to the \nGovernment of Pakistan (GoP):  \n1. Amend the Torture and Custodial Death (Prevention and Punishment) Act to increase \ncompliance with the international standards by expanding the definition of torture to \ninclude   psychological   torture,   repeal   the   provision   penalising   complainants   for \n‘malafide complaints’, define and criminalise cruel, inhuman or degrading treatment \nand  sexual  violence,  and  provide  a  mechanism  for  reparations,  compensation,  and \nrehabilitation. Frame enabling rules and regulations under the Act which reflect the \nprinciples established in the Mandela Rules, Istanbul Protocol, Mendez Principles and \nMinnesota Protocol.  \n2. Take immediate steps to reduce overcrowding in prisons by implementing alternatives \nto  detention,  especially  for  pre-trial  detainees.  Improve  the  living  conditions within",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 942,
            "to": 958
          }
        }
      }
    },
    {
      "id": 81,
      "content": "2. Take immediate steps to reduce overcrowding in prisons by implementing alternatives \nto  detention,  especially  for  pre-trial  detainees.  Improve  the  living  conditions within \nprisons  to  meet  international  standards,  with  particular  attention  to  sanitation, \nhealthcare, and ventilation. \n3. Implement electronic management systems across all prisons in Pakistan to improve \nthe management of the prison population, track prisoner transfers, and ensure that \nmedical treatments are systematically recorded and continued. \n4. Accelerate  the  review  and  amendment  of prison  rules and  related  legislation at  the \nprovincial level to ensure full compliance with the Mandela Rules and Bangkok Rules. \nEnsure that all provinces adopt prison reforms that emphasize the dignity and rights \nof prisoners. \n5. Implement the Punjab Probation and Parole Service Act 2019 and similar laws in other",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 957,
            "to": 968
          }
        }
      }
    },
    {
      "id": 82,
      "content": "Ensure that all provinces adopt prison reforms that emphasize the dignity and rights \nof prisoners. \n5. Implement the Punjab Probation and Parole Service Act 2019 and similar laws in other \nprovinces  effectively,  ensuring  that  these  services  are  accessible  and adequately \nresourced to support the reintegration of offenders into society. \n6. Fully  operationalise  the  Juvenile  Justice  Act  (JJSA)  2018  to  prevent  the  unnecessary \nincarceration  of  children  in  conflict  with  the  law.  Introduce  and  set  up  a  system  of \ndiversion and protection centers as outlined in the law.",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 966,
            "to": 973
          }
        }
      }
    },
    {
      "id": 83,
      "content": "22",
      "metadata": {
        "documentId": "Report-on-ICCPR-2024.pdf",
        "loc": {
          "lines": {
            "from": 979,
            "to": 979
          }
        }
      }
    }
  ],
  "createdAt": "2025-07-27T15:04:47.377Z"
}